<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b31de05f0755ea1ca6cbd93e11695d4bebece813c8587b75ea4c44ca51b9dd38","plan_job_ref":"Job terraform-plan-05-aws-complete #56 at https://github.com/pipetail/terraform/actions/runs/4810282384","plan_hash":"40f9bcc22de555bd45d6776ed60acf9a413217b5b8cc1bc04f1e444acf83e80d","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __examples/05-aws-complete__
<details>
<summary>Plan: 34 to add, 3 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_command_exec will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_command_exec" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.loki_ecs_task_execution_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "loki_ecs_task_execution_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "AllowECSToAuthenticateToECRInCentralAccount"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowECSToPullImage"
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowECSToWriteLogsToCloudWatchLogs"
        }
    }

  # data.aws_iam_policy_document.loki_storage will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "loki_storage" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowLokiStorageChunksS3"
        }
    }

  # aws_budgets_budget.cost will be created
  + resource "aws_budgets_budget" "cost" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + cost_filters      = (known after apply)
      + id                = (known after apply)
      + limit_amount      = "100"
      + limit_unit        = "USD"
      + name              = "overall-cost"
      + name_prefix       = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "MONTHLY"

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "marek.bartik@pipetail.io",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 90
          + threshold_type             = "PERCENTAGE"
        }
    }

  # aws_cloudtrail.main will be created
  + resource "aws_cloudtrail" "main" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "complete-example-main"
      + s3_bucket_name                = (known after apply)
      + tags_all                      = (known after apply)
    }

  # aws_cloudwatch_log_group.command_execution will be created
  + resource "aws_cloudwatch_log_group" "command_execution" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "***************************************************************************"
      + name              = "ecs-command-execution"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.loki will be created
  + resource "aws_cloudwatch_log_group" "loki" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "loki"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_ecr_repository.grafana will be created
  + resource "aws_ecr_repository" "grafana" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "grafana"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.grafana will be created
  + resource "aws_ecs_cluster" "grafana" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "grafana"
      + tags               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana"
        }
      + tags_all           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = "***************************************************************************"
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "ecs-command-execution"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.loki will be created
  + resource "aws_ecs_service" "loki" {
      + cluster                            = "grafana"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "loki"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-06c7bb90be57a2fde",
            ]
          + subnets          = [
              + "subnet-0d2da26fd5a4caeb9",
              + "subnet-0f788476deb1b1cb5",
            ]
        }

      + service_registries {
          + registry_arn = "arn:aws:servicediscovery:eu-west-1:175912345102:service/srv-emo4p4vgdcer2lyu"
        }
    }

  # aws_ecs_task_definition.loki will be created
  + resource "aws_ecs_task_definition" "loki" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "175912345102.dkr.ecr.eu-west-1.amazonaws.com/grafana:loki-2.6.1-arm64"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "loki"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "loki"
                        }
                    }
                  + name             = "loki"
                  + portMappings     = [
                      + {
                          + containerPort = 3100
                          + hostPort      = 3100
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::175912345102:role/loki-ecs-task-execution"
      + family                   = "loki_task_definition"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::175912345102:role/loki-ecs-task"

      + runtime_platform {
          + cpu_architecture = "ARM64"
        }
    }

  # aws_iam_group.eks_access_administrator will be created
  + resource "aws_iam_group" "eks_access_administrator" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks-administrators"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.eks_access_administrator will be created
  + resource "aws_iam_group_policy_attachment" "eks_access_administrator" {
      + group      = "eks-administrators"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.eks_access_administrator_allow_assume will be created
  + resource "aws_iam_policy" "eks_access_administrator_allow_assume" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks_administrator_allow_assume"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sts:AssumeRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::175912345102:role/eks_administrator",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.eks_kubeconfig will be created
  + resource "aws_iam_policy" "eks_kubeconfig" {
      + arn         = (known after apply)
      + description = "allow obtaining of kubeconfig for all EKS clusters"
      + id          = (known after apply)
      + name        = "eks_kubeconfig"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy.loki_ecs_task_command_exec will be created
  + resource "aws_iam_role_policy" "loki_ecs_task_command_exec" {
      + id     = (known after apply)
      + name   = "loki-ecs-command-exec"
      + policy = (known after apply)
      + role   = "loki-ecs-task"
    }

  # aws_iam_role_policy.loki_ecs_task_execution will be created
  + resource "aws_iam_role_policy" "loki_ecs_task_execution" {
      + id     = (known after apply)
      + name   = "loki-ecs-task-execution"
      + policy = (known after apply)
      + role   = "loki-ecs-task-execution"
    }

  # aws_iam_role_policy.loki_storage will be created
  + resource "aws_iam_role_policy" "loki_storage" {
      + id     = (known after apply)
      + name   = "loki-storage-access"
      + policy = (known after apply)
      + role   = "loki-ecs-task"
    }

  # aws_iam_role_policy_attachment.eks_access_administrator_kubeconfig will be created
  + resource "aws_iam_role_policy_attachment" "eks_access_administrator_kubeconfig" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks_administrator"
    }

  # aws_s3_bucket.cloudtrail will be created
  + resource "aws_s3_bucket" "cloudtrail" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "complete-example-cloudtrail"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.loki will be created
  + resource "aws_s3_bucket" "loki" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "complete-example-loki-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.loki will be created
  + resource "aws_s3_bucket_acl" "loki" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_policy.cloudtrail will be created
  + resource "aws_s3_bucket_policy" "cloudtrail" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.cloudtrail will be created
  + resource "aws_s3_bucket_public_access_block" "cloudtrail" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.loki will be created
  + resource "aws_s3_bucket_public_access_block" "loki" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.cloudtrail will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "cloudtrail" {
      + bucket = "complete-example-cloudtrail"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.loki will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "loki" {
      + bucket = "complete-example-loki-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.loki will be created
  + resource "aws_s3_bucket_versioning" "loki" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.eks.data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.ssm will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.eks.module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster" {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.eks.module.eks.aws_autoscaling_group.workers_launch_template[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers_launch_template" {
        id                        = "complete-example-prod-main20230426130154034100000013"
        name                      = "complete-example-prod-main20230426130154034100000013"
        # (24 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-052ffac493db2d5ee"
            name    = "complete-example-prod-main20230426130153024000000011"
          ~ version = "1" -> (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:eu-west-1:175912345102:cluster/complete-example-prod" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EUXlOakV5TlRneU1Gb1hEVE16TURReU16RXlOVGd5TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTmpaCkZETjZuMG5PV1lzZU1kMnI1N1lqckgwa1FhL1NXUndORFY5REZhMVN4TEFVREU3UmV0dDJmWDdjTnpkTThJYysKL3FkRlNiK2ZQcjBPL05WQlFmZ1grZGFxVHM2Nk92OGVRUVBKbDJMelF6dER5dTk1S1VSUUE3cWhxU1o1bitMdgpmcG42cFM1RTlxZDhPcVJHWDgzeVAzVEhNQWZjY01DclFNZTZuRHcycFoyd3Q2a0ZQcUF3QTdiUEtSOWpPcVZUCmtqb3FPUDNsWGdIZnplbTVYeTdpWE5pcFM4NEUyamZJTHg2WVJYUXMrMjZLQ1d1T3FNa1VWMEZob3FCNGR5ckUKR3YwaXQyeDZ6RnNjSUhONmpYb1JSaDIvRWZjK1kzVVg5MjR0YU9CeExKbG5sUzFYYWthK1Fsa2RObk13Wi83VgpkT0ljZ1QyKzB1bGlkTWNER3lzQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZFOURaczBtaWlORy81QWtoclhkOEtqaHhDZytNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBSWJyeThuOFArajFsZHBGVkNiRgo2TjNBNnIvQnl3eVZ6b0VWcXp0cTZnUVRYL2FyY3lJd01NV3hGMy9CQ24vZWo0Vzk2QmVraGtlTWVMTTBWYVdsCndSWXh1L1lTa0dteHVHT0JZeXI2Qy9sNmh2NVhrQWRJUWFrTGFtNlQrbk9HZlR4TlN6UHRobEUreGJ3eGl5NmkKbFhjRHdOSlFzUlN0anh2eDAyaU9haldrM2dOblByWWkxOHpLcHhHMDB2MFFYWmRDc2IyTnhsNXFzemkrQ1JHaAo0VEloNHVucndYUi9BT01UYUpRN2VvUjhMV1BSWG1rekNaU0ZpdzZGMDU0RXdldExwVEdWZ1ZBV2lndzNvemRFCjlPTjFIWW1wbFhqclYrbHI2NDZPZGZQVkRSekpIV2lvUll1b01aTENrWE5KR2pjLzlySU9yTTF2ZFU3UVdTSCsKZXZ3PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2023-04-26 12:53:17.887 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://A9287936212BB4FAECEB8E40BBAF80CC.gr7.eu-west-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "*********************" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.eu-west-1.amazonaws.com/id/A9287936212BB4FAECEB8E40BBAF80CC"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "complete-example-prod"
      ~ platform_version          = "eks.11" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::175912345102:role/complete-example-prod20230416184423097400000003" -> "arn:aws:iam::175912345102:role/complete-example-prod20230426135912549700000003" # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "********************" -> (known after apply)
          ~ vpc_id                    = "*********************" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks.aws_iam_instance_profile.workers_launch_template[0] will be updated in-place
  ~ resource "aws_iam_instance_profile" "workers_launch_template" {
        id          = "complete-example-prod2023042613015255070000000c"
        name        = "complete-example-prod2023042613015255070000000c"
      ~ role        = "complete-example-prod2023042613015166250000000b" -> (known after apply)
        tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "complete-example-prod"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_launch_template.workers_launch_template[0] will be updated in-place
  ~ resource "aws_launch_template" "workers_launch_template" {
        id                      = "lt-052ffac493db2d5ee"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "complete-example-prod-main20230426130153024000000011"
        tags                    = {}
      ~ user_data               = "IyBodHRwczovL2dpdGh1Yi5jb20vYm90dGxlcm9ja2V0LW9zL2JvdHRsZXJvY2tldC9ibG9iL2RldmVsb3AvUkVBRE1FLm1kI2Rlc2NyaXB0aW9uLW9mLXNldHRpbmdzCltzZXR0aW5ncy5rdWJlcm5ldGVzXQphcGktc2VydmVyID0gImh0dHBzOi8vQTkyODc5MzYyMTJCQjRGQUVDRUI4RTQwQkJBRjgwQ0MuZ3I3LmV1LXdlc3QtMS5la3MuYW1hem9uYXdzLmNvbSIKY2x1c3Rlci1jZXJ0aWZpY2F0ZSA9ICJMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNdmFrTkRRV1ZoWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplazFFVVhsT2FrVjVUbFJuZVUxR2IxaEVWRTE2VFVSUmVVMTZSWGxPVkdkNVRVWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVG1wYUNrWkVUalp1TUc1UFYxbHpaVTFrTW5JMU4xbHFja2d3YTFGaEwxTlhVbmRPUkZZNVJFWmhNVk40VEVGVlJFVTNVbVYwZERKbVdEZGpUbnBrVFRoSll5c0tMM0ZrUmxOaUsyWlFjakJQTDA1V1FsRm1aMWdyWkdGeFZITTJOazkyT0dWUlVWQktiREpNZWxGNmRFUjVkVGsxUzFWU1VVRTNjV2h4VTFvMWJpdE1kZ3BtY0c0MmNGTTFSVGx4WkRoUGNWSkhXRGd6ZVZBelZFaE5RV1pqWTAxRGNsRk5aVFp1UkhjeWNGb3lkM1EyYTBaUWNVRjNRVGRpVUV0U09XcFBjVlpVQ210cWIzRlBVRE5zV0dkSVpucGxiVFZZZVRkcFdFNXBjRk00TkVVeWFtWkpUSGcyV1ZKWVVYTXJNalpMUTFkMVQzRk5hMVZXTUVab2IzRkNOR1I1Y2tVS1IzWXdhWFF5ZURaNlJuTmpTVWhPTm1wWWIxSlNhREl2Uldaaksxa3pWVmc1TWpSMFlVOUNlRXhLYkc1c1V6RllZV3RoSzFGc2EyUk9iazEzV2k4M1ZncGtUMGxqWjFReUt6QjFiR2xrVFdORVIzbHpRMEYzUlVGQllVNWFUVVpqZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkZPVVJhY3pCdGFXbE9SeTgxUVd0b2NsaGtPRXRxYUhoRFp5dE5RbFZIUVRGVlpFVlJVVThLVFVGNVEwTnRkREZaYlZaNVltMVdNRnBZVFhkRVVWbEtTMjlhU1doMlkwNUJVVVZNUWxGQlJHZG5SVUpCU1dKeWVUaHVPRkFyYWpGc1pIQkdWa05pUmdvMlRqTkJObkl2UW5sM2VWWjZiMFZXY1hwMGNUWm5VVlJZTDJGeVkzbEpkMDFOVjNoR015OUNRMjR2WldvMFZ6azJRbVZyYUd0bFRXVk1UVEJXWVZkc0NuZFNXWGgxTDFsVGEwZHRlSFZIVDBKWmVYSTJReTlzTm1oMk5WaHJRV1JKVVdGclRHRnRObFFyYms5SFpsUjRUbE42VUhSb2JFVXJlR0ozZUdsNU5ta0tiRmhqUkhkT1NsRnpVbE4wYW5oMmVEQXlhVTloYWxkck0yZE9ibEJ5V1dreE9IcExjSGhITURCMk1GRllXbVJEYzJJeVRuaHNOWEZ6ZW1rclExSkhhQW8wVkVsb05IVnVjbmRZVWk5QlQwMVVZVXBSTjJWdlVqaE1WMUJTV0cxcmVrTmFVMFpwZHpaR01EVTBSWGRsZEV4d1ZFZFdaMVpCVjJsbmR6TnZlbVJGQ2psUFRqRklXVzF3YkZocWNsWXJiSEkyTkRaUFpHWlFWa1JTZWtwSVYybHZVbGwxYjAxYVRFTnJXRTVLUjJwakx6bHlTVTl5VFRGMlpGVTNVVmRUU0NzS1pYWjNQUW90TFMwdExVVk9SQ0JEUlZKVVNVWkpRMEZVUlMwdExTMHRDZz09IgpjbHVzdGVyLW5hbWUgPSAiY29tcGxldGUtZXhhbXBsZS1wcm9kIgptYXgtcG9kcyA9IDE3CltzZXR0aW5ncy5rdWJlcm5ldGVzLm5vZGUtbGFiZWxzXQpub2RlcG9vbCA9ICJtYWluIgoiYm90dGxlcm9ja2V0LmF3cy91cGRhdGVyLWludGVyZmFjZS12ZXJzaW9uIiA9ICIyLjAuMCIKCgoKCiMgSGFyZGVuaW5nIGJhc2VkIG9uIGh0dHBzOi8vZ2l0aHViLmNvbS9ib3R0bGVyb2NrZXQtb3MvYm90dGxlcm9ja2V0L2Jsb2IvZGV2ZWxvcC9TRUNVUklUWV9HVUlEQU5DRS5tZAoKIyBFbmFibGUga2VybmVsIGxvY2tkb3duIGluICJpbnRlZ3JpdHkiIG1vZGUuCiMgVGhpcyBwcmV2ZW50cyBtb2RpZmljYXRpb25zIHRvIHRoZSBydW5uaW5nIGtlcm5lbCwgZXZlbiBieSBwcml2aWxlZ2VkIHVzZXJzLgpbc2V0dGluZ3Mua2VybmVsXQpsb2NrZG93biA9ICJpbnRlZ3JpdHkiCgojIFRoZSBhZG1pbiBob3N0IGNvbnRhaW5lciBwcm92aWRlcyBTU0ggYWNjZXNzIGFuZCBydW5zIHdpdGggInN1cGVycG93ZXJzIi4KIyBJdCBpcyBkaXNhYmxlZCBieSBkZWZhdWx0LCBidXQgY2FuIGJlIGRpc2FibGVkIGV4cGxpY2l0bHkuCltzZXR0aW5ncy5ob3N0LWNvbnRhaW5lcnMuYWRtaW5dCmVuYWJsZWQgPSB0cnVlCgojIFRoZSBjb250cm9sIGhvc3QgY29udGFpbmVyIHByb3ZpZGVzIG91dC1vZi1iYW5kIGFjY2VzcyB2aWEgU1NNLgojIEl0IGlzIGVuYWJsZWQgYnkgZGVmYXVsdCwgYW5kIGNhbiBiZSBkaXNhYmxlZCBpZiB5b3UgZG8gbm90IGV4cGVjdCB0byB1c2UgU1NNLgojIFRoaXMgY291bGQgbGVhdmUgeW91IHdpdGggbm8gd2F5IHRvIGFjY2VzcyB0aGUgQVBJIGFuZCBjaGFuZ2Ugc2V0dGluZ3Mgb24gYW4gZXhpc3Rpbmcgbm9kZSEKW3NldHRpbmdzLmhvc3QtY29udGFpbmVycy5jb250cm9sXQplbmFibGVkID0gdHJ1ZQo=" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (11 unchanged blocks hidden)
    }

  # module.eks.module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_complete-example-prod"
      + id                   = (known after apply)
    }

Plan: 34 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [terraform-plan-05-aws-complete #56](https://github.com/pipetail/terraform/actions/runs/4810282384)